Revit 2027 API
ParameterTypeId.AllModelTypeComments Property
 "Type Comments"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AllModelTypeComments { get; }
Public Shared ReadOnly Property AllModelTypeComments As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AllModelTypeComments {
	ForgeTypeId^ get ();
}
static member AllModelTypeComments : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace